In [1]:
import pandas as pd
from sqlalchemy import create_engine

### Extract CSVs into DataFrames

In [2]:
premise_file = "../Resources/LicensePremise.csv"
premise_data_df = pd.read_csv(premise_file)
premise_data_df.head()

,License Serial Number,Premises Name,License Certificate Number,License Received Date,County ID Code
0,1311660,CANA ARRIBA GROCERY NO 2 INC,NaN,2018-06-29T00:00:00,0
1,1310023,JOHANA GROCERY & DELI CORP,NaN,2018-04-27T00:00:00,0
2,1310024,TKO BEVERAGES LLC,NaN,2018-04-27T00:00:00,1
3,1310024,TKO BEVERAGES LLC,NaN,2018-04-27T00:00:00,1
4,1311663,181 LEXINGTON AVENUE BBQ LLC,NaN,2018-06-29T00:00:00,2

In [3]:
county_file = "../Resources/CountyLicenseCount.csv"
county_data_df = pd.read_csv(county_file)
county_data_df.head()

   ID County Name (Licensee)  County ID Code  License Count
0   0                 ALBANY               5             77
1   1               ALLEGANY              59              4
2   2                  BRONX               0            104
3   3                 BROOME              35             14
4   4            CATTARAUGUS              41              9

### Transform premise DataFrame

In [52]:
new_premise_data_df = premise_data_df[['Premises Name', 'County ID Code']].copy()
new_premise_data_df.columns = ['premise_name', 'county_id']
new_premise_data_df['id'] = new_premise_data_df.index
new_premise_data_df.head()

                   premise_name  county_id  id
0  CANA ARRIBA GROCERY NO 2 INC          0   0
1    JOHANA GROCERY & DELI CORP          0   1
2             TKO BEVERAGES LLC          1   2
3             TKO BEVERAGES LLC          1   3
4  181 LEXINGTON AVENUE BBQ LLC          2   4

### Transform county DataFrame

In [30]:
new_county_data_df = county_data_df[['ID', 'County Name (Licensee)', 'License Count', 'County ID Code']].copy()
new_county_data_df.columns = ['id', 'county_name', 'license_count','county_id']
new_county_data_df.head()

   id  county_name  license_count  county_id
0   0       ALBANY             77          5
1   1     ALLEGANY              4         59
2   2        BRONX            104          0
3   3       BROOME             14         35
4   4  CATTARAUGUS              9         41

### Create database connection

In [53]:
rds_connection_string = "root:j9stuart@127.0.0.1/customer_db"
engine = create_engine(f'mysql://{rds_connection_string}')

In [54]:
# Confirm tables
engine.table_names()

['county', 'premise']

### Load DataFrames into database

In [55]:
new_premise_data_df.to_sql(name='premise', con=engine, if_exists='append', index=False)

In [41]:
new_county_data_df.to_sql(name='county', con=engine, if_exists='append', index=False)